Revit 2027 API
BuiltInFailures.RebarShapeFailures.CurveOverconstrained Property
 Segment is overconstrained. It has at least one parameterized dimension that conflicts with another dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveOverconstrained { get; }
Public Shared ReadOnly Property CurveOverconstrained As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveOverconstrained {
	FailureDefinitionId^ get ();
}
static member CurveOverconstrained : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace